tap "domq/gdb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU binary tools for native development
brew "binutils"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Console Matrix
brew "cmatrix"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Safe, concurrent, practical language
brew "rust"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Multi-track audio editor and recorder
cask "audacity"
# 3D creation suite
cask "blender"
# Web browser focusing on privacy
cask "brave-browser"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Filesharing using Direct Connect and ADC protocols
cask "eiskaltdcpp"
# Reimagine your terminal
cask "fig"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Free and open-source painting and sketching program
cask "krita"
# Digital logic designer and simulator
cask "logisim-evolution"
# SPICE simulation software, schematic capture and waveform viewer
cask "ltspice"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# App to write, plan, collaborate, and get organized
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Client program for the OpenVPN Access Server
cask "openvpn-connect"
# Collaborative presentation software
cask "pitch"
# Environment for statistical computing and graphics
cask "r"
# Data science software focusing on R and Python
cask "rstudio"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# General-purpose text editor
cask "textmate"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
mas "AdGuard for Safari", id: 1440147259
mas "Boop", id: 1518425043
mas "Codye", id: 1516894961
mas "GarageBand", id: 682658836
mas "GeoGebra Classic 6", id: 1182481622
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Vectornator", id: 1219074514
