tap "domq/gdb"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Powerful, lightweight programming language
brew "lua"
# Mac App Store command-line interface
brew "mas"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Theme for zsh
brew "powerlevel10k"
# Python bindings for v5 of Qt
brew "pyqt@5"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Penetration testing for SQL injection and database servers
brew "sqlmap"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Chromium based browser
cask "arc"
# Multi-track audio editor and recorder
cask "audacity"
# Web browser focusing on privacy
cask "brave-browser"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
# Desktop client for GitHub repositories
cask "github"
# Java IDE by JetBrains
cask "intellij-idea"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Media player based on MPlayer and mplayer2
cask "mpv"
# Free and open-source RSS reader
cask "netnewswire"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# IDE for professional Python development
cask "pycharm"
# Peer to peer Bitorrent client
cask "qbittorrent"
# Environment for statistical computing and graphics
cask "r"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Git client
cask "sublime-merge"
# Text editor for code, markup and prose
cask "sublime-text"
# General-purpose text editor
cask "textmate"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "AdGuard for Safari", id: 1440147259
mas "Boop", id: 1518425043
mas "Codye", id: 1516894961
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft To Do", id: 1274495053
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "brettcannon.zephyr-asdl"
vscode "cschlosser.doxdocgen"
vscode "daohong-emilio.yash"
vscode "DavidAnson.vscode-markdownlint"
vscode "eamodio.gitlens"
vscode "fortran-lang.linter-gfortran"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "IBM.output-colorizer"
vscode "jaredly.reason-vscode"
vscode "jeff-hykin.better-cpp-syntax"
vscode "joaompinto.vscode-graphviz"
vscode "jock.svg"
vscode "josetr.cmake-language-support-vscode"
vscode "julialang.language-julia"
vscode "LeetCode.vscode-leetcode"
vscode "mechatroner.rainbow-csv"
vscode "modular-mojotools.vscode-mojo"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "PKief.material-icon-theme"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sourcery.sourcery"
vscode "streetsidesoftware.code-spell-checker"
vscode "teabyii.ayu"
vscode "twxs.cmake"
vscode "vadimcn.vscode-lldb"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "wesbos.theme-cobalt2"
